#Generated by Fabric Compiler ( version 2022.2-SP1-Lite <build 132640> ) at Sat Nov 11 09:59:24 2023

add_design "D:/Project/FPGA_Project/Pango/multimedia_video_processor/sources/designs/multimedia_video_processor.v"
add_constraint "D:/Project/FPGA_Project/Pango/multimedia_video_processor/sources/constraints/multimedia_video_processor.fdc"
remove_constraint  -logic -fdc "D:/Project/FPGA_Project/Pango/multimedia_video_processor/sources/constraints/ddr_fdc.fdc"
remove_design -verilog "D:/Project/FPGA_Project/Pango/multimedia_video_processor/sources/designs/psd_ddr_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
add_constraint "D:/Project/FPGA_Project/Pango/multimedia_video_processor/project/kkk.rcf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module multimedia_video_processor
synthesize -ads -frequency {100} -selected_syn_tool_opt 2 
dev_map 
pnr -fix_hold_violation 
report_timing 
gen_bit_stream 
